10/data/attachments/9f119d2bcc010a6a.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_8cdd6833-6495-4db6-89e0-19594688a3e5</nif:username>
            <nif:friendToBeAdded>David_least_Actions_66006_1</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>